Documents/бит_ИсковоеЗаявление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ИсковоеЗаявление</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЮридическихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйУчасток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СудебныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиОт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительскиеРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абзац</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределениеСуда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправленВСуд</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ИсковоеЗаявление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричинаОтмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Печать</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_ПредставительскиеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПредставительскиеРасходы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_Подписанты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_Подписанты</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ОтветственныеЛицаПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ОтветственныеЛицаПоКУ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыЮридическихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЮридическихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СудебныйПриказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсковоеЗаявление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_СтатусПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СтатусПроживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроживает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ИсковоеЗаявление/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЛицевойСчетПриИзменении()
	ЛицевойСчетПриИзмененииНаСервере();
	ПодстановкаСуммыЗадолженностиСервер();
	ПроверитьТипКвартиры();
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	ПодстановкаСуммыЗадолженностиСервер();	
КонецПроцедуры



&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Квартира.Наименование КАК Квартира,
	|	бит_СписокЗданий.Наименование КАК НомерДома,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК Улица,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира1,
	|	бит_СписокЗданий.СудебныйУчасток КАК СудебныйУчасток,
	|	бит_ЛицевыеСчета.Здание.ПочтовыйАдрес КАК ЗданиеПочтовыйАдрес
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|		ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЛицевойСчет.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Объект.Адрес = "";
		Объект.СудебныйУчасток = Справочники.бит_СудебныеУчастки.ПустаяСсылка();
		
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		Строка = Выборка.ЗданиеПочтовыйАдрес;
		НачалоСтроки = "г";
		КоличествоУдаляемыхСимволов = СтрНайти(Строка, НачалоСтроки)-1;
		ДлинаСтроки = СтрДлина(Строка) - КоличествоУдаляемыхСимволов;
		НоваяСтрока = Прав(Строка,ДлинаСтроки);
		
		Объект.Адрес = "" + НоваяСтрока + " кв. " + Выборка.Квартира;
		Объект.Здание = Выборка.Здание;
		Объект.Квартира = Выборка.Квартира1;
		Объект.СудебныйУчасток = Выборка.СудебныйУчасток;
		
	КонецЕсли;                                                               
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаЗадолженностиПриИзменении();
	
	СуммаЗадолженностиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПодстановкаСуммыЗадолженностиСервер();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ.ГруппаУслуги <> ЗНАЧЕНИЕ(Справочник.бит_ГруппыУслуг.ПустаяСсылка)
	|			ТОГДА бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ.ГруппаУслуги
	|		ИНАЧЕ бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ
	|	КОНЕЦ КАК УслугаЖКХ,
	|	СУММА(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&ДатаОстатков, ) КАК бит_НачисленияПоУслугамЖКХОстатки
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет В(&ЛицевойСчет)
	|	И бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ В(&УслугаЖКХ)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ.ГруппаУслуги <> ЗНАЧЕНИЕ(Справочник.бит_ГруппыУслуг.ПустаяСсылка)
	|			ТОГДА бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ.ГруппаУслуги
	|		ИНАЧЕ бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ЛицевойСчет",Объект.ЛицевойСчет);
	Запрос.УстановитьПараметр("УслугаЖКХ",ГруппаУслуг(Объект.Услуга));
	Запрос.УстановитьПараметр("ДатаОстатков",НачалоМесяца(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда                        
		Объект.СуммаЗадолженности = Выборка.СуммаОстаток;
	Иначе
		Объект.СуммаЗадолженности = 0;
	КонецЕсли; 
	
КонецПроцедуры


функция ГруппаУслуг(Услуга)
	
	ЗапросУслуги = Новый Запрос;
	ЗапросУслуги.Текст = 
	"ВЫБРАТЬ
	|  бит_УслугиЖКХ.Ссылка КАК Услуга
	|ИЗ
	|  Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|ГДЕ
	|  бит_УслугиЖКХ.ГруппаУслуги В(&ОбязательныеГруппыУслуг)";
	
	ОбязательныеУслуги = Новый Массив();
	ОбязательныеУслуги.Добавить(Услуга.ГруппаУслуги);
	
	ЗапросУслуги.УстановитьПараметр("ОбязательныеГруппыУслуг", ОбязательныеУслуги);
	РезультатЗапроса = ЗапросУслуги.Выполнить();
	
	Если  НЕ РезультатЗапроса.Пустой() Тогда
		ОтборУслуги = РезультатЗапроса.Выгрузить();
		ОтборУслуги = ОтборУслуги.ВыгрузитьКолонку("Услуга");
	Иначе
		ОтборУслуги = Услуга;
	КонецЕсли;
	
	Возврат ОтборУслуги;
	
КонецФункции
&НаСервере
Процедура СуммаЗадолженностиПриИзмененииНаСервере()
	
	СуммаЗадолженности = Объект.СуммаЗадолженности;
	РГП = РасчетГоспошлины();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ПредставительскиеРасходыСрезПоследних.Стоимость КАК Стоимость
	|ИЗ
	|	РегистрСведений.бит_ПредставительскиеРасходы.СрезПоследних(&Период, ) КАК бит_ПредставительскиеРасходыСрезПоследних";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.ПредставительскиеРасходы = Выборка.Стоимость;
		
	КонецЕсли;
	
	

	Если РГП.Количество() > 0 Тогда
		Если Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыЮридическихДокументов.СудебныйПриказ") Тогда
			
			Объект.Госпошлина = ?(СуммаЗадолженности <= РГП[0].КонечнаяСуммаДолга, Макс((СуммаЗадолженности * РГП[0].Процент)/2, РГП[0].МинимальныйРазмерПошлины), 
			? (СуммаЗадолженности <= РГП[1].КонечнаяСуммаДолга, (800 + (СуммаЗадолженности - РГП[0].КонечнаяСуммаДолга) * РГП[1].Процент)/2,
			? (СуммаЗадолженности <= РГП[2].КонечнаяСуммаДолга, (3200 + (СуммаЗадолженности - РГП[1].КонечнаяСуммаДолга) * РГП[2].Процент)/2,
			? (СуммаЗадолженности <= РГП[3].КонечнаяСуммаДолга, (5200 + (СуммаЗадолженности - РГП[2].КонечнаяСуммаДолга) * РГП[3].Процент)/2,
			Мин((6600 + (СуммаЗадолженности - РГП[4].КонечнаяСуммаДолга) * РГП[4].Процент)/2, 60000)
			))));
			
			//Объект.Госпошлина = ?(СуммаЗадолженности <= 20000, Макс(СуммаЗадолженности * 0.04, 200), 
			//? (СуммаЗадолженности <= 100000, 400 + (СуммаЗадолженности - 20000) * 0.03,
			//? (СуммаЗадолженности <= 200000, 1600 + (СуммаЗадолженности - 100000) * 0,02,
			//? (СуммаЗадолженности <= 1000000, 2600 + (СуммаЗадолженности - 200000) * 0.01,
			//Мин(6600 + (СуммаЗадолженности - 1000000) * 0.005 ,60000)
			//))));
			
		Иначе
			Объект.Госпошлина = ?(СуммаЗадолженности <= РГП[0].КонечнаяСуммаДолга, Макс(СуммаЗадолженности * РГП[0].Процент, РГП[0].МинимальныйРазмерПошлины), 
			? (СуммаЗадолженности <= РГП[1].КонечнаяСуммаДолга, РГП[1].ФиксированнаяЧастьПошлины + (СуммаЗадолженности - РГП[0].КонечнаяСуммаДолга) * РГП[1].Процент,
			? (СуммаЗадолженности <= РГП[2].КонечнаяСуммаДолга, РГП[2].ФиксированнаяЧастьПошлины + (СуммаЗадолженности - РГП[1].КонечнаяСуммаДолга) * РГП[2].Процент,
			? (СуммаЗадолженности <= РГП[3].КонечнаяСуммаДолга, РГП[3].ФиксированнаяЧастьПошлины + (СуммаЗадолженности - РГП[2].КонечнаяСуммаДолга) * РГП[3].Процент,
			Мин(РГП[4].ФиксированнаяЧастьПошлины + (СуммаЗадолженности - РГП[3].КонечнаяСуммаДолга) * РГП[4].Процент, 60000)
			))));
			
			
			//Объект.Госпошлина = ?(СуммаЗадолженности <= 20000, Макс(СуммаЗадолженности * 0.04, 400), 
			//? (СуммаЗадолженности <= 100000, 800 + (СуммаЗадолженности - 20000) * 0.03,
			//? (СуммаЗадолженности <= 200000, 3200 + (СуммаЗадолженности - 100000) * 0.02,
			//? (СуммаЗадолженности <= 1000000, 5200 + (СуммаЗадолженности - 200000) * 0.01,
			//Мин(13200 + (СуммаЗадолженности - 1000000) * 0.005 ,60000)
			//))));
			
		КонецЕсли;
	КонецЕсли;
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ТекстСообщения = НСтр("ru = 'Перед печатью запишите документ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
	КонецЕсли; 
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Параметры.Ключ);
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 
// СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
КонецПроцедуры 
&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
КонецПроцедуры 
&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте 
Процедура ПриОткрытии(Отказ) 
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры 
&НаСервере 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период",ТекущаяДата());
		
		Запрос.Текст = "ВЫБРАТЬ
		|	бит_ПодписантыСрезПоследних.ФИО КАК ФИО
		|ИЗ
		|	РегистрСведений.бит_Подписанты.СрезПоследних(&Период, ) КАК бит_ПодписантыСрезПоследних";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Объект.Подписант = Выборка.ФИО;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период",ТекущаяДата());
		Запрос.Текст = "ВЫБРАТЬ
		|	бит_ПредставительскиеРасходыСрезПоследних.Стоимость КАК Стоимость
		|ИЗ
		|	РегистрСведений.бит_ПредставительскиеРасходы.СрезПоследних(&Период, ) КАК бит_ПредставительскиеРасходыСрезПоследних";
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Объект.ПредставительскиеРасходы = Выборка.Стоимость;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		
	КонецЕсли;   
	Если Объект.Ссылка.Пустая() Тогда        
		Объект.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "5503245214");
		Объект.Абзац = Истина;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры 
&НаСервере 
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры 

//ответчики
&НаКлиенте
Процедура ПодборИзСпискаПроживающих(Команда)
	
	ЭтаФорма.Модифицированность = Истина;
	
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	мСписокЗначений = ПолучитьСписокЗначенийНаСервере(КонецМесяца(Объект.Дата), Объект.ЛицевойСчет);
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Ссылка", мСписокЗначений);
	
	//ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаИсковоеЗаявление", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗначенийНаСервере(Знач Дата, Знач ЛицевойСчет);
	
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	РезультатЗапроса = ПолучитьСписокПроживающих(Дата, ЛицевойСчет);
	ТаблицаФизЛиц    = РезультатЗапроса.Выгрузить();
	
	ЗагрузитьТаблицуНаСервере(ТаблицаФизЛиц);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	мСписокЗначений = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл 
		
		мСписокЗначений.Добавить(Выборка.ФизЛицо)
		
	КонецЦикла;
	
	Возврат мСписокЗначений;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокПроживающих(Знач Дата, Знач ЛицевойСчет)
	
	Запрос =  Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	|	ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ДатаЗаписи КАК ДатаЗаписи,
	|	ОтветственныеЛицаПоКУСрезПоследних.Контрагент КАК Контрагент,
	|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры КАК ВладелецКвартиры,
	|	ПроживающиеПоЛССрезПоследних.ДоляПлощади КАК ДоляПлощади,
	|	ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы КАК ПравоустанавливающиеДокументы,
	|	ПроживающиеПоЛССрезПоследних.КудаВыписан КАК КудаВыписан,
	|	ПроживающиеПоЛССрезПоследних.ОткудаПрибыл КАК ОткудаПрибыл
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныеЛицаПоКУСрезПоследних
	|		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет = ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет
	|			И ПроживающиеПоЛССрезПоследних.ФизЛицо = ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ НЕ ПроживающиеПоЛССрезПоследних.ДоляПлощади = 0
	|			ИЛИ ПроживающиеПоЛССрезПоследних.СтепеньРодства.Наименование = ""Ответственное лицо""
	|			ИЛИ ПроживающиеПоЛССрезПоследних.СтатусПроживания.Ссылка <> ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.НеПроживает))";
	
	
	
	
	Запрос.УстановитьПараметр("Момент"     , Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Возврат РезультатЗапроса;	
	
КонецФункции // ()

&НаСервере
Процедура ЗагрузитьТаблицуНаСервере(ТаблицаФизЛиц)
	
	СтараяТаблица = РеквизитФормыВЗначение("мТаблицаФизЛиц");
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Колонка Из ТаблицаФизЛиц.Колонки Цикл
		
		Если СтараяТаблица.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "мТаблицаФизЛиц"));
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	Объект.Ответчики.Очистить();
	
	Для каждого стр из ТаблицаФизЛиц Цикл
		
		НоваяСтрока = Объект.Ответчики.Добавить();
		
		НоваяСтрока.ФизЛицо = стр.ФизЛицо;
		
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	ЗначениеВРеквизитФормы(ТаблицаФизЛиц, "мТаблицаФизЛиц");
	
КонецПроцедуры



&НаКлиенте
Процедура СписокПроживающихФизЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", Новый Структура("ТекЭлемент", Элементы.Ответчики.ТекущиеДанные.ФизЛицо), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветчикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	
	НоваяСтрока = Объект.Ответчики.Добавить();
	
	НоваяСтрока.ФизЛицо          = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка");
КонецПроцедуры

&НаСервере
Функция РасчетГоспошлины()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияОРазмерахГоспошлиныСрезПоследних.Период КАК Период,
	|	СведенияОРазмерахГоспошлиныСрезПоследних.НачальнаяСуммаДолга КАК НачальнаяСуммаДолга,
	|	СведенияОРазмерахГоспошлиныСрезПоследних.КонечнаяСуммаДолга КАК КонечнаяСуммаДолга,
	|	СведенияОРазмерахГоспошлиныСрезПоследних.ПроцентПошлины/100 КАК Процент,
	|	СведенияОРазмерахГоспошлиныСрезПоследних.ФиксированнаяЧастьПошлины КАК ФиксированнаяЧастьПошлины,
	|	СведенияОРазмерахГоспошлиныСрезПоследних.МинимальныйРазмерПошлины КАК МинимальныйРазмерПошлины,
	|	СведенияОРазмерахГоспошлиныСрезПоследних.МаксимальныйРазмерПошлины КАК МаксимальныйРазмерПошлины
	|ИЗ
	|	РегистрСведений.СведенияОРазмерахГоспошлины.СрезПоследних(&Период, ТипДокумента = &ТипДокумента) КАК СведенияОРазмерахГоспошлиныСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачальнаяСуммаДолга";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("ТипДокумента", Объект.ТипДокумента);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	СуммаЗадолженностиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УслугаПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Документ", Объект.Ссылка);
КонецПроцедуры

&НаСервере 
Процедура ПроверитьТипКвартиры()	 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",Объект.Дата);
	Запрос.УстановитьПараметр("Квартира", Объект.Квартира);
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних
	|ГДЕ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира = &Квартира";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.ТипКвартиры = Справочники.бит_ТипыКвартиры.НежилоеПомещение  Тогда  
			Объект.ПредставительскиеРасходы = 0;
			Элементы.Госпошлина.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;	 
КонецПроцедуры
